/*
Navicat MySQL Data Transfer

Source Server         : mySql
Source Server Version : 50528
Source Host           : localhost:3306
Source Database       : gserver

Target Server Type    : MYSQL
Target Server Version : 50528
File Encoding         : 65001

Date: 2020-01-08 20:18:51
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for shang_gu_yao_wang_info
-- ----------------------------
DROP TABLE IF EXISTS `shang_gu_yao_wang_info`;
CREATE TABLE `shang_gu_yao_wang_info` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `npcID` int(11) unsigned zerofill DEFAULT '00000000000',
  `level` int(11) unsigned zerofill DEFAULT '00000000000',
  `state` tinyint(1) unsigned zerofill DEFAULT '0',
  `reward` varchar(255) DEFAULT '',
  `wa_chu_account_id` int(11) unsigned zerofill DEFAULT '00000000000',
  `wa_chu_reward` varchar(255) DEFAULT '',
  `xiao_guai` varchar(255) DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of shang_gu_yao_wang_info
-- ----------------------------
INSERT INTO `shang_gu_yao_wang_info` VALUES ('1', '00000001312', '00000000050', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('2', '00000001313', '00000000052', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('3', '00000001314', '00000000054', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('4', '00000001315', '00000000056', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('5', '00000001316', '00000000058', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('6', '00000001317', '00000000060', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('7', '00000001318', '00000000062', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('8', '00000001319', '00000000064', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('9', '00000001320', '00000000066', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('10', '00000001321', '00000000068', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('11', '00000001322', '00000000070', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('12', '00000001323', '00000000072', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('13', '00000001324', '00000000074', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('14', '00000001325', '00000000076', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('15', '00000001326', '00000000078', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('16', '00000001327', '00000000080', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('17', '00000001328', '00000000082', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('18', '00000001329', '00000000084', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('19', '00000001330', '00000000086', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
INSERT INTO `shang_gu_yao_wang_info` VALUES ('20', '00000001331', '00000000088', '1', '经验#500,道行#500,装备#蓝色:200,物品#[风寂云清\'枯月流魂\'雷极弧光\'凝香幻彩\'炫影霜星\'冰落残阳]:200', '00000005864', '经验#500,道行#500', '骷髅战将,狐狸精,琵琶精,千面怪');
